app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ravi@yopmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "auth_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["auth_token", "e5922edd79fa507143c28e6f9666a250"], ["updated_at", "2017-08-28 11:59:33.625155"], ["id", 1]]
---
			def create
				@user = User.find_by_email params[:email]
				if @user && @user.authenticate(params[:password])
					@user.update_attribute(:auth_token , @user.generate_auth_token)