app/controllers/api/v1/users_controller.rb

INSERT INTO "user_profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 5], ["created_at", "2017-08-28 10:20:12.323039"], ["updated_at", "2017-08-28 10:20:12.323039"]]
INSERT INTO "users" ("user_name", "email", "password_digest", "phone", "address", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
			def create
				@user = User.new(user_params)
				if @user.valid?
					@user.build_user_profile(profile_params)
					@user.auth_token = @user.generate_auth_token
					@user.save!